## Plan for org_account/iam_identity_center
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 7 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                   NAME                                                   |
|--------|----------------------------------------------------------------------------------------------------------|
| add    | `aws_identitystore_group.forms_production_rds_query_access`                                              |
|        | `aws_identitystore_group.forms_staging_rds_query_access`                                                 |
|        | `aws_ssoadmin_account_assignment.forms_production[&quot;Forms-Production-RDS-Query-Access-RDS-Query-Access&quot;]` |
|        | `aws_ssoadmin_account_assignment.forms_production[&quot;Forms-Production-ReadOnly-Billing-ReadOnly&quot;]`         |
|        | `aws_ssoadmin_account_assignment.forms_staging[&quot;Forms-Staging-RDS-Query-Access-RDS-Query-Access&quot;]`       |
|        | `aws_ssoadmin_permission_set.rds_query_access`                                                           |
|        | `aws_ssoadmin_permission_set_inline_policy.rds_query_access`                                             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_identitystore_group.forms_production_rds_query_access will be created
  + resource "aws_identitystore_group" "forms_production_rds_query_access" {
      + description       = "Grants members access to the RDS query editor in the GC Forms Production account."
      + display_name      = "Forms-Production-RDS-Query-Access"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_identitystore_group.forms_staging_rds_query_access will be created
  + resource "aws_identitystore_group" "forms_staging_rds_query_access" {
      + description       = "Grants members access to the RDS query editor in the GC Forms Staging account."
      + display_name      = "Forms-Staging-RDS-Query-Access"
      + external_ids      = (known after apply)
      + group_id          = (known after apply)
      + id                = (known after apply)
      + identity_store_id = "d-9d67173bdd"
    }

  # aws_ssoadmin_account_assignment.forms_production["Forms-Production-RDS-Query-Access-RDS-Query-Access"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "957818836222"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.forms_production["Forms-Production-ReadOnly-Billing-ReadOnly"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_production" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = "arn:aws:sso:::permissionSet/ssoins-8824c710b5ddb452/ps-155a8dac774b6771"
      + principal_id       = "8c2d15d8-10d1-7001-5385-99d8811d41a3"
      + principal_type     = "GROUP"
      + target_id          = "957818836222"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_account_assignment.forms_staging["Forms-Staging-RDS-Query-Access-RDS-Query-Access"] will be created
  + resource "aws_ssoadmin_account_assignment" "forms_staging" {
      + id                 = (known after apply)
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
      + principal_id       = (known after apply)
      + principal_type     = "GROUP"
      + target_id          = "687401027353"
      + target_type        = "AWS_ACCOUNT"
    }

  # aws_ssoadmin_permission_set.rds_query_access will be created
  + resource "aws_ssoadmin_permission_set" "rds_query_access" {
      + arn              = (known after apply)
      + created_date     = (known after apply)
      + description      = "Grants access to the RDS query editor and Secrets used for authentication."
      + id               = (known after apply)
      + instance_arn     = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + name             = "RDS-Query-Access"
      + session_duration = "PT1H"
      + tags_all         = (known after apply)
    }

  # aws_ssoadmin_permission_set_inline_policy.rds_query_access will be created
  + resource "aws_ssoadmin_permission_set_inline_policy" "rds_query_access" {
      + id                 = (known after apply)
      + inline_policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:TagResource",
                          + "secretsmanager:PutSecretValue",
                          + "secretsmanager:PutResourcePolicy",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:DeleteSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:*:*:secret:rds-db-credentials/*"
                      + Sid      = "SecretsDatabaseCredentialsWrite"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:*:*:secret:database-secret-*"
                      + Sid      = "SecretsDatabaseCredentialsRead"
                    },
                  + {
                      + Action   = [
                          + "tag:GetResources",
                          + "secretsmanager:ListSecrets",
                          + "secretsmanager:GetRandomPassword",
                          + "secretsmanager:CreateSecret",
                          + "rds-data:RollbackTransaction",
                          + "rds-data:ExecuteStatement",
                          + "rds-data:CommitTransaction",
                          + "rds-data:BeginTransaction",
                          + "rds-data:BatchExecuteStatement",
                          + "dbqms:UpdateQueryHistory",
                          + "dbqms:UpdateFavoriteQuery",
                          + "dbqms:GetQueryString",
                          + "dbqms:DescribeQueryHistory",
                          + "dbqms:DescribeFavoriteQueries",
                          + "dbqms:DeleteQueryHistory",
                          + "dbqms:DeleteFavoriteQueries",
                          + "dbqms:CreateQueryHistory",
                          + "dbqms:CreateFavoriteQuery",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "RDSQueryEditorAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + instance_arn       = "arn:aws:sso:::instance/ssoins-8824c710b5ddb452"
      + permission_set_arn = (known after apply)
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_pinpoint_sms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_s3_website_assets"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.admin_support_center"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.canadian_digital_service_production_website_admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.notify_access_ecs_blazer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.rds_query_access"]
WARN - plan.json - main - Missing Common Tags: ["aws_ssoadmin_permission_set.read_only_billing"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
